Revit 2027 API
RailingType.SecondaryHandrailType Property
 The type of the secondary handrail.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId SecondaryHandrailType { get; set; }
Public Property SecondaryHandrailType As ElementId
	Get
	Set
public:
property ElementId^ SecondaryHandrailType {
	ElementId^ get ();
	void set (ElementId^ value);
}
member SecondaryHandrailType : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The handRailTypeId is not a valid hand rail type.
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
RailingType Class
Autodesk.Revit.DB.Architecture Namespace